In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [8]:
x=['A','B','C']
data=pd.Series(x,index=[1,2,3])
data

1    A
2    B
3    C
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [11]:
data.index=[11,12,13]
data

11    A
12    B
13    C
dtype: object

## Q3: Retrieve First and second elements.

In [14]:
data[:2]

11    A
12    B
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [39]:
a=pd.Series({14 :'B'})
data2=pd.concat([data,a])
data2

11    A
12    B
13    C
14    B
dtype: object

In [40]:
data2.drop_duplicates()

11    A
12    B
13    C
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [47]:
data3 = {'ID': [111, 222],
        'Name': ['Razan', 'Razan2'],
        'GPA': [5,4]
       }

student= pd.DataFrame(data3, columns=['ID', 'Name', 'GPA'])
student

    ID    Name  GPA
0  111   Razan    5
1  222  Razan2    4

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [48]:
da=pd.read_csv('educ_figdp_1_Data.csv')
da.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [49]:
da.loc[0:2]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [50]:
da[0:2]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN